Aliguzel01/STM32-I2C/i2c_slave_tx_string2.c
/*
 * i2c_slave_tx_string2.c
 *
 *  Created on: 15 Eyl 2020
 *      Author: HP
 */


#include<stdio.h>
#include<string.h>
#include "stm32f407xx.h"

//extern void initialise_monitor_handles();



#define MY_ADDR 0x68;
 uint32_t data_len=0;
#define SLAVE_ADDR  0x68

 //very large message
uint8_t Tx_buf[] = "HiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHi...123";

uint8_t CommandCode;

void delay(void)
{
	for(uint32_t i = 0 ; i < 500000/2 ; i ++);
}

I2C_Handle_t I2C1Handle;

//rcv buffer
uint8_t rcv_buf[32];

/*
 * PB6-> SCL
 * PB7 -> SDA
 */

void I2C1_GPIOInits(void)
{
	GPIO_Handle_t I2CPins;

	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins. GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//scl
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&I2CPins);


	//sda
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GPIO_Init(&I2CPins);


}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_ACKControl= I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;

	I2C_Init(&I2C1Handle);

}

void GPIO_ButtonInit(void)
{
	GPIO_Handle_t GPIOBtn,GpioLed;

	//this is btn gpio configuration
	GPIOBtn.pGPIOx = GPIOA;
	GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIOBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GPIOBtn);

	//this is led gpio configuration
	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOD,ENABLE);

	GPIO_Init(&GpioLed);

}


int main(void)
{


	//initialise_monitor_handles();

	//printf("Application is running\n");

	 data_len = strlen((char*)Tx_buf);

	GPIO_ButtonInit();

	//i2c pin inits
	I2C1_GPIOInits();

	//i2c peripheral configuration
	I2C1_Inits();

	//enable the i2c peripheral
	I2C_PeripheralControl(I2C1,ENABLE);

	//ack bit is made 1 after PE=1
	I2C_ManageAcking(I2C1,I2C_ACK_ENABLE);

	I2C_IRQInterruptConfig(IRQ_NO_I2C1_ER,ENABLE);
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_EV,ENABLE);

	I2C_SlaveEnableDisableCallbackEvents(I2C1,ENABLE);


	while(1);
}


void  I2C_ApplicationEventCallback (I2C_Handle_t * pI2CHandle, uint8_t AppEv)
{


	static  uint32_t cnt = 0 ;
	static  uint32_t w_ptr = 0 ;



	if(AppEv == I2C_ERROR_AF)
	{
		// Bu, ikincil öğenin veriyi ana bilgisayara aktarması sırasında gerçekleşir.
		// bağımlı, yöneticinin artık veriye ihtiyacı olmadığını anlamalı
		// köle Tx'in sonunu tamamlıyor


		// mevcut aktif kod 0x52 ise geçersiz kılmayın
		if(! (CommandCode == 0x52 ))
			CommandCode = 0XFF ;

		// cnt değişkenini sıfırlayın çünkü iletimin sonu
		cnt = 0 ;

		// Slave, w_ptr data_len'e ulaştığında tüm baytları gönderdiği sonucuna varır
		if(w_ptr>=(data_len))
		{
			w_ptr = 0 ;
			CommandCode = 0xff ;
		}

	} else  if (AppEv == I2C_EV_STOP)
	{
		// Bu, son bağımlı alım sırasında gerçekleşecek
		// köle Rx'in sonunu tamamlar

		cnt = 0 ;

	} else  if (AppEv == I2C_EV_DATA_REQ)
	{
		// Master, verileri istiyor. veri gönder
		if(CommandCode == 0x51 )
		{
			// Burada 4 bayt uzunluk bilgisi gönderiyoruz
			I2C_SlaveSendData (I2C1, ((data_len >> ((cnt% 4 ) * 8 )) & 0xFF ));
		    cnt ++;
		} else  if (CommandCode == 0x52 )
		{
			// w_ptr değişkenine göre indekslenmiş Tx_buf içeriğini gönderme
			I2C_SlaveSendData (I2C1, Tx_buf[w_ptr++]);
		}
	} else  if (AppEv == I2C_EV_DATA_RCV)
	{
		// Master komut kodunu gönderdi, oku
		 CommandCode = I2C_SlaveReceiveData (I2C1);

	}
}


void  I2C1_EV_IRQHandler ( void )
{

	I2C_EV_IRQHandling (& I2C1Handle);
}



void  I2C1_ER_IRQHandler ( void )
{

	I2C_ER_IRQHandling (& I2C1Handle);
}
